# Taps (Third-party repositories)
tap "eddieantonio/eddieantonio"
tap "jesseduffield/lazygit"
tap "jstkdng/programs"
tap "koekeishiya/formulae"
tap "lutzifer/tap"
tap "pls-rs/pls"
tap "thezoraiz/ascii-image-converter"
tap "zegervdv/zathura"

# CLI Essentials & Core Utilities
brew "coreutils"  # provides greadlink, used in .zshrc
brew "highlight"  # syntax highlighting in fzf previews
brew "mas"        # Mac App Store CLI, required for mas entries below
brew "bat"
brew "btop"
brew "fd"
brew "fzf"
brew "htop"
brew "lazygit"
brew "ripgrep"
brew "tmux"
brew "tokei"
brew "zoxide"
brew "midnight-commander"
brew "ranger"

# Development & Shell
brew "mise"  # <--- ADDED THIS HERE
brew "bob" # Neovim version manager
brew "fswatch"
brew "gitleaks"
brew "gnupg"
brew "starship"
brew "thefuck"
brew "lua-language-server"
brew "ltex-ls"
brew "luarocks"
brew "pipx"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Media & Image CLI Tools
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "imagemagick"
brew "feh"
brew "chafa"
brew "mpv"
brew "pngpaste"
brew "spotify-tui"
brew "eddieantonio/eddieantonio/imgcat"
brew "jstkdng/programs/ueberzugpp"
brew "thezoraiz/ascii-image-converter/ascii-image-converter"

# PDF & Documents
brew "mupdf"
brew "pandoc"
brew "latexml"
brew "zegervdv/zathura/zathura"
brew "zegervdv/zathura/zathura-pdf-poppler"

# Network & Web
brew "wget"
brew "w3m"
brew "mutt"   # terminal email client
brew "httpd"  # Apache local web server

# Databases
brew "mysql"
brew "mysql-client"
brew "phpmyadmin"
cask "mysql-connector-python"

# Tiling Window Management
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

# Miscellaneous Tools
brew "analog"
brew "ccrypt"
brew "choose-gui"
brew "cloc"
brew "ctags"
brew "ddrescue"
brew "foremost"
cask "macfuse"
brew "neofetch"
brew "safe-rm"
brew "testdisk"
brew "lutzifer/tap/keyboardswitcher"
brew "pls-rs/pls/pls"

# GUI Applications (Casks)
# cask "alt-tab"
cask "font-hack-nerd-font"
cask "inkscape"
cask "latexit"
# cask "neovide-app"
cask "sage"
# cask "sioyek"
# cask "spaceman"


#Other Applications
# cask "brave-browser"
# cask "discord"
# cask "spotify"
# cask "raycast"
# cask "zoom"
# cask "vlc"
# cask "obsidian"
# cask "zotero"
# cask "anki"
# cask "audacity"

cask "slack"
# cask "microsoft-word"
# cask "microsoft-excel"
cask "microsoft-teams"
cask "microsoft-powerpoint"
# cask "adobe-acrobat-reader"

cask "kitty"
# cask "iterm2"

# cask "keyclu"
# cask "android-file-transfer"
# cask "syncthing"
# cask "skim"

# Mac App Store (Requires 'mas' CLI, which Brew installs automatically if needed)
# mas "Accelerate", id: 1459809092
# mas "Calendar for Google Calendar", id: 1596768976
# mas "Dropover", id: 1355679052
# mas "Fantastical", id: 975937182
# mas "GrandPerspective", id: 1111570163
# mas "Scenecuts", id: 1540491573
# mas "Snap", id: 418073146
# mas "WhatsApp", id: 310633997
